# GetClTextStyleRef

## Description
Function GetClTextStyleRef gets the text style of the specified class.  The integer style is the internal index of the text style.

```pascal
FUNCTION GetClTextStyleRef(className : STRING): LONGINT;
```

```python
def vs.GetClTextStyleRef(className):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class|

## See Also
VS Functions:
SetClUseTextStyle
| GetClUseTextStyle
| SetClTextStyleRef

## Version
Availability: from Vectorworks 2015

## Category
* Classes